<?php
// ---------------- session ----------------
// user_online     เก็บข้อมูลว่าใคร online
// status_online  เก็บสถานะว่าใคร online
// amc_code_online เก็บรหัสว่า สกต ไหน online
// ---------------------------------------------
//$amc_code_online = "ก014034";

$webSite['title'] = ' โปรแกรมบริหารจัดการ สกต. ';
$webSite['meta'] = '<META http-equiv=Content-Type content=text/html; charset=windows-874>';
$webSite['meta'] = $webSite['meta'].'<META http-equiv=Cache-Control content=no-Cache>';
$webSite['meta'] = $webSite['meta'].'<META NAME="Generator" CONTENT="EditPlus">';
$webSite['meta'] = $webSite['meta'].'<META http-equiv="X-UA-Compatible" content="IE=7"/>';
$webSite['meta'] = $webSite['meta'].'<META NAME="Author" CONTENT="นายธนวุฒิ  สุรินทร์">';
$webSite['meta'] = $webSite['meta'].'<META NAME="Keywords" CONTENT="โปรแกรมบริหารจัดการข้อมูล สกต.">';
$webSite['meta'] = $webSite['meta'].'<META NAME="Description" CONTENT=" กองสารสนเทศ ฝ่ายเทคโนโลยีสารสนเทศ 4471 ">';

$webSite['intro'] = ' โปรแกรมบริหารจัดการระบบงาน สกต. ';
$webSite['footer'] = 'มีปัญหาการใช้งาน กรุณาติดต่อ 3288, 3289  |  ฝ่ายข้อมูล ฝทส. 8849';
$webSite['footer_admin'] = 'มีปัญหาการใช้งานโปรแกรมติดต่อ นายธนวุฒิ  สุรินทร์ กองสารสนเทศ 4471';
$webSite['copyright'] = ' Copyright @ 2009  ทีมสารสนเทศเพื่อการจัดการ กองสารสนเทศ ธนาคารเพื่อการเกษตรและสหกรณ์การเกษตร  All rights reserved.';

$market_connect = ' ระบบไม่อนุญาตให้แก้ไขข้อมูล กรุณาติดต่อ WAN : 2866';  // ข้อความแจ้งเตือนการแก้ไขข้อมูล

$color['header']='#FFCCCC';    // สีหัวตาราง
$color['column']='#FFCCCC';    // สีที่หัวข้อใน column
$color['footer']='#FFCCCC';     // สีท้ายตาราง
$color['rows']='#FFCCCC';       //  สีของแถวที่แสดงปกติ
$color['row1']='#FFCCCC';      //  สีของแถวที่ต้องการให้สลับ 1
$color['row2']='#FFCCCC';      // สีของแถวที่ต้องการให้สลับ 2
$color['report']='#FFCCCC';    //   สีของหัวข้อรายงาน
$color['over'] ='#FFCCCC';      // สีของ mouse over

$data['max_rows'] = 30;          // จำนวนแถวสูงสุดที่ให้แสดงต่อหน้า

// รหัสสาขา
$branch_list = array("00"=>'0',"01"=>'1',"02"=>'2',"03"=>'3',"04"=>'4',"05"=>'5',"06"=>'6',"07"=>'7',"08"=>'8',"09"=>'9',"10"=>'A',"11"=>'B',"12"=>"C","13"=>"D","14"=>"E","15"=>"F","16"=>"G","17"=>"H","18"=>"I","19"=>"J","20"=>"K","21"=>"L","22"=>"M","23"=>"N","24"=>"O","25"=>"P","26"=>"Q","27"=>"R","28"=>"S","29"=>"T","30"=>"U","31"=>"V","32"=>"W","33"=>"X","34"=>"Y","35"=>"Z");

$chk_current_amc = array("12"=>'3',"11"=>'2',"10"=>'1',"9"=>'12',"8"=>'11',"7"=>'10',"6"=>'9',"5"=>'8',"4"=>'7',"3"=>'6',"2"=>'5',"1"=>'1');

// ใช้ในการออกรายงานเท่านั้น
//$month_report = array("1"=>'10',"2"=>'11',"3"=>'12',"4"=>'1',"5"=>'2',"6"=>'3',"7"=>'4',"8"=>'5',"9"=>'6',"10"=>'7',"11"=>'8',"12"=>'9');

// ใช้ในการออกรายงานเท่านั้น
$month_report2 = array("1"=>'13',"2"=>'14',"3"=>'15',"4"=>'4',"5"=>'5',"6"=>'6',"7"=>'7',"8"=>'8',"9"=>'9',"10"=>'10',"11"=>'11',"12"=>'12');
$month_report3 = array("15"=>'3',"14"=>'2',"13"=>'1',"12"=>'12',"11"=>'11',"10"=>'10',"9"=>'9',"8"=>'8',"7"=>'7',"6"=>'6',"5"=>'5',"4"=>'4');

?>