<? include ("checkuser.php");?>
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=tis-620">
<link href="images/lib/mainstyle.css" rel="stylesheet" type="text/css">
<link href="images/css/style.css" rel="stylesheet" type="text/css">
</head>
<script language="JavaScript">
var arrDiv = new Array();
arrDiv[0] = new Array('00-รวมประเทศ-','01ภาคเหนือตอนบน','02ภาคเหนือตอนล่าง','03ภาคตะวันออกเฉียงเหนือตอนบน','04ภาคตะวันออกเฉียงเหนือตอนล่าง','05ภาคกลาง','06ภาคตะวันออก','07ภาคตะวันตก','08ภาคใต้ตอนบน','09ภาคใต้ตอนล่าง');
var arrData = new Array();
arrData[01] = new Array('57เชียงราย','50เชียงใหม่','55น่าน','56พะเยา','54แพร่','58แม่ฮ่องสอน','52ลำปาง','51ลำพูน');
arrData[02] = new Array('53อุตรดิตถ์','60นครสวรรค์','61อุทัยธานี','62กำแพงเพชร','63ตาก','64สุโขทัย','65พิษณุโลก','66พิจิตร','67เพชรบูรณ์');
arrData[03] = new Array('39หนองบัวลำภู','40ขอนแก่น','41อุดรธานี','42เลย','43หนองคาย','44มหาสารคาม','45ร้อยเอ็ด','46กาฬสินธุ์','47สกลนคร','48นครพนม','49มุกดาหาร');
arrData[04] = new Array('30นครราชสีมา','31บุรีรัมย์','32สุรินทร์','33ศรีสะเกษ','34อุบลราชธานี','35ยโสธร','36ชัยภูมิ','37อำนาจเจริญ');
arrData[05] = new Array('10กรุงเทพมหานคร','12นนทบุรี','13ปทุมธานี','14พระนครศรีอยุธยา','15อ่างทอง','16ลพบุรี','17สิงห์บุรี','18ชัยนาท','19สระบุรี');
arrData[06] = new Array('11สมุทรปราการ','20ชลบุรี','21ระยอง','22จันทบุรี','23ตราด','24ฉะเชิงเทรา','25ปราจีนบุรี','26นครนายก','27สระแก้ว');
arrData[07] = new Array('70ราชบุรี','71กาญจนบุรี','72สุพรรณบุรี','73นครปฐม','74สมุทรสาคร','75สมุทรสงคราม','76เพชรบุรี','77ประจวบคีรีขันธ์');
arrData[08] = new Array('81กระบี่','82พังงา','83ภูเก็ต','84สุราษฎร์ธานี','85ระนอง','86ชุมพร');
arrData[09] = new Array('80นครศรีธรรมราช','90สงขลา','91สตูล','92ตรัง','93พัทลุง','94ปัตตานี','95ยะลา','96นราธิวาส');
var arrBrn = new Array();
arrBrn[10] = new Array('1001เขตพระนคร','1002เขตดุสิต','1003เขตหนองจอก','1004เขตบางรัก','1005เขตบางเขน','1006เขตบางกะปิ','1007เขตปทุมวัน','1008เขตป้อมปราบศัตรูพ่าย','1009เขตพระโขนง','1010เขตมีนบุรี','1011เขตลาดกระบัง','1012เขตยานนาวา','1013เขตสัมพันธวงศ์','1014เขตพญาไท','1015เขตธนบุรี','1016เขตบางกอกใหญ่','1017เขตห้วยขวาง','1018เขตคลองสาน','1019เขตตลิ่งชัน','1020เขตบางกอกน้อย','1021เขตบางขุนเทียน','1022เขตภาษีเจริญ','1023เขตหนองแขม','1024เขตราษฎร์บูรณะ','1025เขตบางพลัด','1026เขตดินแดง','1027เขตบึงกุ่ม','1028เขตสาทร','1029เขตบางซื่อ','1030เขตจตุจักร','1031เขตบางคอแหลม','1032เขตประเวศ','1033เขตคลองเตย','1034เขตสวนหลวง','1035เขตจอมทอง','1036เขตดอนเมือง','1037เขตราชเทวี','1038เขตลาดพร้าว','1039เขตวัฒนา','1040เขตบางแค','1041เขตหลักสี่','1042เขตสายไหม','1043เขตคันนายาว','1044เขตสะพานสูง','1045เขตวังทองหลาง','1046เขตคลองสามวา','1047เขตบางนา','1048เขตทวีวัฒนา','1049เขตทุ่งครุ','1050เขตบางบอน'); 
arrBrn[11] = new Array('1106กิ่งอำเภอบางเสาธง','1102บางบ่อ','1103บางพลี','1104พระประแดง','1105พระสมุทรเจดีย์','1101เมืองสมุทรปราการ');
arrBrn[12] = new Array('1205ไทรน้อย','1202บางกรวย','1204บางบัวทอง','1203บางใหญ่','1206ปากเกร็ด','1201เมืองนนทบุรี');
arrBrn[13] = new Array('1302คลองหลวง','1303ธัญบุรี','1301เมืองปทุมธานี','1305ลาดหลุมแก้ว','1306ลำลูกกา','1307สามโคก','1304หนองเสือ');
arrBrn[14] = new Array('1402ท่าเรือ','1403นครหลวง','1413บางซ้าย','1405บางบาล','1407บางปะหัน','1406บางปะอิน','1404บางไทร','1416บ้านแพรก','1408ผักไห่','1401พระนครศรีอยุธยา','1409ภาชี','1415มหาราช','1410ลาดบัวหลวง','1411วังน้อย','1412เสนา','1414อุทัย');
arrBrn[15] = new Array('1502ไชโย','1503ป่าโมก','1504โพธิ์ทอง','1501เมืองอ่างทอง','1506วิเศษชัยชาญ','1507สามโก้','1505แสวงหา');
arrBrn[16] = new Array('1603โคกสำโรง','1609โคกเจริญ','1604ชัยบาดาล','1605ท่าวุ้ง','1607ท่าหลวง','1606บ้านหมี่','1602พัฒนานิคม','1601เมืองลพบุรี','1610ลำสนธิ','1608สระโบสถ์','1611หนองม่วง');
arrBrn[17] = new Array('1703ค่ายบางระจัน','1705ท่าช้าง','1702บางระจัน','1704พรหมบุรี','1701เมืองสิงห์บุรี','1706อินทร์บุรี');
arrBrn[18] = new Array('1807กิ่งอำเภอหนองมะโมง','1808กิ่งอำเภอเนินขาม','1801เมืองชัยนาท','1802มโนรมย์','1803วัดสิงห์','1805สรรคบุรี','1804สรรพยา','1806หันคา');
arrBrn[19] = new Array('1902แก่งคอย','1913เฉลิมพระเกียรติ','1907ดอนพุด','1906บ้านหมอ','1909พระพุทธบาท','1911มวกเหล็ก','1901เมืองสระบุรี','1912วังม่วง','1904วิหารแดง','1910เสาไห้','1903หนองแค','1905หนองแซง','1908หนองโดน');
arrBrn[20] = new Array('2011กิ่งอำเภอเกาะจันทร์','2008เกาะสีชัง','2004บางละมุง','2010บ่อทอง','2002บ้านบึง','2006พนัสนิคม','2005พานทอง','2001เมืองชลบุรี','2007ศรีราชา','2009สัตหีบ','2003หนองใหญ่');
arrBrn[21] = new Array('2108กิ่งอำเภอนิคมพัฒนา','2107กิ่งอำเภอเขาชะเมา','2103แกลง','2105บ้านค่าย','2102บ้านฉาง','2106ปลวกแดง','2101เมืองระยอง','2104วังจันทร์');
arrBrn[22] = new Array('2210กิ่งอำเภอเขาคิชฌกูฏ','2208แก่งหางแมว','2202ขลุง','2203ท่าใหม่','2209นายายอาม','2204โป่งน้ำร้อน','2205มะขาม','2201เมืองจันทบุรี','2207สอยดาว','2206แหลมสิงห์');
arrBrn[23] = new Array('2306กิ่งอำเภอเกาะกูด','2307กิ่งอำเภอเกาะช้าง','2303เขาสมิง','2302คลองใหญ่','2304บ่อไร่','2301เมืองตราด','2305แหลมงอบ');
arrBrn[24] = new Array('2411กิ่งอำเภอคลองเขื่อน','2410ท่าตะเกียบ','2402บางคล้า','2403บางน้ำเปรี้ยว','2404บางปะกง','2405บ้านโพธิ์','2409แปลงยาว','2406พนมสารคาม','2401เมืองฉะเชิงเทรา','2407ราชสาส์น','2408สนามชัยเขต');
arrBrn[25] = new Array('2502กบินทร์บุรี','2503นาดี','2506บ้านสร้าง','2507ประจันตคาม','2501เมืองปราจีนบุรี','2508ศรีมหาโพธิ','2509ศรีมโหสถ');
arrBrn[26] = new Array('2603บ้านนา','2602ปากพลี','2601เมืองนครนายก','2604องครักษ์');
arrBrn[77] = new Array('2709กิ่งอำเภอวังสมบูรณ์','2708กิ่งอำเภอโคกสูง','2707เขาฉกรรจ์','2702คลองหาด','2703ตาพระยา','2701เมืองสระแก้ว','2704วังน้ำเย็น','2705วัฒนานคร','2706อรัญประเทศ');
arrBrn[30] = new Array('3030กิ่งอำเภอบัวลาย','3028กิ่งอำเภอพระทองคำ','3029กิ่งอำเภอลำทะเมนชัย','3031กิ่งอำเภอสีดา','3026กิ่งอำเภอเทพารักษ์','3027กิ่งอำเภอเมืองยาง','3023แก้งสนามนาง','3019ขามทะเลสอ','3011ขามสะแกแสง','3004คง','3002ครบุรี','3006จักราช','3032เฉลิมพระเกียรติ','3017ชุมพวง','3007โชคชัย','3008ด่านขุนทด','3010โนนสูง','3024โนนแดง','3009โนนไทย','3012บัวใหญ่','3005บ้านเหลื่อม','3013ประทาย','3014ปักธงชัย','3021ปากช่อง','3015พิมาย','3001เมืองนครราชสีมา','3025วังน้ำเขียว','3020สีคิ้ว','3018สูงเนิน','3003เสิงสาง','3022หนองบุญมาก','3016ห้วยแถลง');
arrBrn[31] = new Array('3103กระสัง','3121กิ่งอำเภอบ้านด่าน','3122กิ่งอำเภอแคนดง','3102คูเมือง','3123เฉลิมพระเกียรติ','3118ชำนิ','3104นางรอง','3113นาโพธิ์','3120โนนดินแดง','3117โนนสุวรรณ','3108บ้านกรวด','3119บ้านใหม่ไชยพจน์','3107ประโคนชัย','3112ปะคำ','3115พลับพลาชัย','3109พุทไธสง','3101เมืองบุรีรัมย์','3106ละหานทราย','3110ลำปลายมาศ','3111สตึก','3105หนองกี่','3114หนองหงส์','3116ห้วยราช');
arrBrn[32] = new Array('3206กาบเชิง','3214กิ่งอำเภอพนมดงรัก','3215กิ่งอำเภอศรีณรงค์','3216กิ่งอำเภอเขวาสินรินทร์','3217กิ่งอำเภอโนนนารายณ์','3204จอมพระ','3202ชุมพลบุรี','3203ท่าตูม','3213บัวเชด','3205ปราสาท','3201เมืองสุรินทร์','3207รัตนบุรี','3211ลำดวน','3209ศีขรภูมิ','3208สนม','3210สังขะ','3212สำโรงทาบ');
arrBrn[33] = new Array('3304กันทรลักษ์','3303กันทรารมย์','3322กิ่งอำเภอศิลาลาด','3321กิ่งอำเภอโพธิ์ศรีสุวรรณ','3305ขุขันธ์','3308ขุนหาญ','3313โนนคูณ','3315น้ำเกลี้ยง','3311บึงบูรพ์','3319เบญจลักษ์','3307ปรางค์กู่','3320พยุห์','3306ไพรบึง','3317ภูสิงห์','3318เมืองจันทร์','3301เมืองศรีสะเกษ','3302ยางชุมน้อย','3309ราษีไศล','3316วังหิน','3314ศรีรัตนะ','3312ห้วยทับทัน','3310อุทุมพรพิสัย');
arrBrn[34] = new Array('3412กุดข้าวปุ้น','3405เขมราฐ','3404เขื่องใน','3403โขงเจียม','3424ดอนมดแดง','3407เดชอุดม','3411ตระการพืชผล','3420ตาลสุม','3408นาจะหลวย','3409น้ำยืน','3410บุณฑริก','3419พิบูลมังสาหาร','3421โพธิ์ไทร','3401เมืองอุบลราชธานี','3414ม่วงสามสิบ','3415วารินชำราบ','3402ศรีเมืองใหม่','3422สำโรง','3425สิรินธร','3426ทุ่งศรีอุดม','3429กิ่งอำเภอนาเยีย','3430กิ่งอำเภอนาตาล','3431กิ่งอำเภอเหล่าเสือโก้ก');
arrBrn[35] = new Array('3503กุดชุม','3504คำเขื่อนแก้ว','3507ค้อวัง','3502ทรายมูล','3509ไทยเจริญ','3505ป่าติ้ว','3506มหาชนะชัย','3501เมืองยโสธร','3508เลิงนกทา');
arrBrn[36] = new Array('3616กิ่งอำเภอซับใหญ่','3604เกษตรสมบูรณ์','3612แก้งคร้อ','3603คอนสวรรค์','3613คอนสาร','3606จัตุรัส','3609เทพสถิต','3615เนินสง่า','3607บำเหน็จณรงค์','3602บ้านเขว้า','3611บ้านแท่น','3614ภักดีชุมพล','3610ภูเขียว','3601เมืองชัยภูมิ','3608หนองบัวระเหว','3605หนองบัวแดง');
arrBrn[37] = new Array('3702ชานุมาน','3703ปทุมราชวงศา','3704พนา','3701เมืองอำนาจเจริญ','3707ลืออำนาจ','3705เสนางคนิคม','3706หัวตะพาน');
arrBrn[39] = new Array('3902นากลาง','3906นาวัง','3903โนนสัง','3901เมืองหนองบัวลำภู','3904ศรีบุญเรือง','3905สุวรรณคูหา');
arrBrn[40] = new Array('4009กระนวน','4021กิ่งอำเภอซำสูง','4024กิ่งอำเภอบ้านแฮด','4023กิ่งอำเภอหนองนาคำ','4022กิ่งอำเภอโคกโพธิ์ไชย','4025กิ่งอำเภอโนนศิลา','4019เขาสวนกวาง','4018ชนบท','4005ชุมแพ','4007น้ำพอง','4002บ้านฝาง','4010บ้านไผ่','4011เปือยน้อย','4003พระยืน','4012เมืองพล','4020ภูผาม่าน','4016ภูเวียง','4017มัญจาคีรี','4001เมืองขอนแก่น','4014แวงน้อย','4013แวงใหญ่','4006สีชมพู','4015หนองสองห้อง','4004หนองเรือ','4008อุบลรัตน์');
arrBrn[41] = new Array('4102กุดจับ','4104กุมภวาปี','4108ไชยวาน','4107ทุ่งฝน','4105โนนสะอาด','4118น้ำโสม','4111บ้านดุง','4117บ้านผือ','4119เพ็ญ','4101เมืองอุดรธานี','4110วังสามหมอ','4109ศรีธาตุ','4120สร้างคอม','4103หนองวัวซอ','4106หนองหาน','4121หนองแสง','4122นายูง','4123พิบูลย์รักษ์','4124กิ่งอำเภอกู่แก้ว','4125กิ่งอำเภอประจักษ์ศิลปาคม');
arrBrn[42] = new Array('4214กิ่งอำเภอหนองหิน','4213กิ่งอำเภอเอราวัณ','4203เชียงคาน','4205ด่านซ้าย','4208ท่าลี่','4202นาด้วง','4206นาแห้ว','4204ปากชม','4212ผาขาว','4210ภูกระดึง','4211ภูหลวง','4207ภูเรือ','4201เมืองเลย','4209วังสะพุง');
arrBrn[43] = new Array('4316กิ่งอำเภอรัตนวาปี','4314กิ่งอำเภอสระใคร','4315กิ่งอำเภอเฝ้าไร่','4317กิ่งอำเภอโพธิ์ตาก','4309เซกา','4306โซ่พิสัย','4302ท่าบ่อ','4303บึงกาฬ','4311บึงโขงหลง','4313บุ่งคล้า','4310ปากคาด','4304พรเจริญ','4305โพนพิสัย','4301เมืองหนองคาย','4312ศรีวิไล','4307ศรีเชียงใหม่','4308สังคม');
arrBrn[44] = new Array('4404กันทรวิชัย','4412กิ่งอำเภอกุดรัง','4413กิ่งอำเภอชื่นชม','4402แกดำ','4403โกสุมพิสัย','4405เชียงยืน','4410นาดูน','4407นาเชือก','4406บรบือ','4408พยัคฆภูมิพิสัย','4401เมืองมหาสารคาม','4411ยางสีสุราช','4409วาปีปทุม');
arrBrn[45] = new Array('4520กิ่งอำเภอทุ่งเขาหลวง','4519กิ่งอำเภอหนองฮี','4518กิ่งอำเภอเชียงขวัญ','4502เกษตรวิสัย','4504จตุรพักตรพิมาน','4517จังหาร','4505ธวัชบุรี','4503ปทุมรัตต์','4506พนมไพร','4508โพธิ์ชัย','4513โพนทราย','4507โพนทอง','4515เมยวดี','4501เมืองร้อยเอ็ด','4512เมืองสรวง','4516ศรีสมเด็จ','4511สุวรรณภูมิ','4510เสลภูมิ','4509หนองพอก','4514อาจสามารถ');
arrBrn[46] = new Array('4603กมลาไสย','4618กิ่งอำเภอฆ้องชัย','4617กิ่งอำเภอดอนจาน','4616กิ่งอำเภอนาคู','4615กิ่งอำเภอสามชัย','4605กุฉินารายณ์','4606เขาวง','4610คำม่วง','4611ท่าคันโท','4602นามน','4601เมืองกาฬสินธุ์','4607ยางตลาด','4604ร่องคำ','4613สมเด็จ','4609สหัสขันธ์','4612หนองกุงศรี','4614ห้วยผึ้ง','4608ห้วยเม็ก');
arrBrn[47] = new Array('4703กุดบาก','4702กุสุมาลย์','4709คำตากล้า','4715โคกศรีสุพรรณ','4716เจริญศิลป์','4714เต่างอย','4707นิคมน้ำอูน','4710บ้านม่วง','4704พรรณานิคม','4705พังโคน','4717โพนนาแก้ว','4718ภูพาน','4701เมืองสกลนคร','4708วานรนิวาส','4706วาริชภูมิ','4712สว่างแดนดิน','4713ส่องดาว','4711อากาศอำนวย');
arrBrn[48] = new Array('4812กิ่งอำเภอวังยาง','4803ท่าอุเทน','4805ธาตุพนม','4811นาทม','4809นาหว้า','4807นาแก','4804บ้านแพง','4802ปลาปาก','4810โพนสวรรค์','4801เมืองนครพนม','4806เรณูนคร','4808ศรีสงคราม');
arrBrn[49] = new Array('4905คำชะอี','4904ดงหลวง','4903ดอนตาล','4902นิคมคำสร้อย','4901เมืองมุกดาหาร','4907หนองสูง','4906หว้านใหญ่');
arrBrn[50] = new Array('5024กิ่งอำเภอดอยหล่อ','5023กิ่งอำเภอแม่ออน','5002จอมทอง','5004เชียงดาว','5021ไชยปราการ','5005ดอยสะเก็ด','5017ดอยเต่า','5009ฝาง','5011พร้าว','5001เมืองเชียงใหม่','5007แม่ริม','5022แม่วาง','5010แม่อาย','5003แม่แจ่ม','5006แม่แตง','5020เวียงแหง','5008สะเมิง','5013สันกำแพง','5014สันทราย','5012สันป่าตอง','5019สารภี','5015หางดง','5018อมก๋อย','5016ฮอด');
arrBrn[51] = new Array('5108กิ่งอำเภอเวียงหนองล่อง','5105ทุ่งหัวช้าง','5107บ้านธิ','5103บ้านโฮ่ง','5106ป่าซาง','5101เมืองลำพูน','5102แม่ทา','5104ลี้');
arrBrn[52] = new Array('5203เกาะคา','5205งาว','5206แจ้ห่ม','5208เถิน','5213เมืองปาน','5201เมืองลำปาง','5210แม่ทะ','5209แม่พริก','5202แม่เมาะ','5207วังเหนือ','5211สบปราบ','5204เสริมงาม','5212ห้างฉัตร');
arrBrn[53] = new Array('5302ตรอน','5309ทองแสนขัน','5303ท่าปลา','5304น้ำปาด','5306บ้านโคก','5307พิชัย','5305ฟากท่า','5301เมืองอุตรดิตถ์','5308ลับแล');
arrBrn[54] = new Array('5405เด่นชัย','5401เมืองแพร่','5402ร้องกวาง','5403ลอง','5407วังชิ้น','5406สอง','5404สูงเม่น','5408หนองม่วงไข่');
arrBrn[55] = new Array('5514กิ่งอำเภอภูเพียง','5515เฉลิมพระเกียรติ','5509เชียงกลาง','5508ทุ่งช้าง','5506ท่าวังผา','5504นาน้อย','5510นาหมื่น','5512บ่อเกลือ','5503บ้านหลวง','5505ปัว','5501เมืองน่าน','5502แม่จริม','5507เวียงสา','5513สองแคว','5511สันติสุข');
arrBrn[56] = new Array('5609กิ่งอำเภอภูกามยาว','5608กิ่งอำเภอภูซาง','5602จุน','5603เชียงคำ','5604เชียงม่วน','5605ดอกคำใต้','5606ปง','5601เมืองพะเยา','5607แม่ใจ');
arrBrn[57] = new Array('5718กิ่งอำเภอดอยหลวง','5717กิ่งอำเภอเวียงเชียงรุ้ง','5714ขุนตาล','5703เชียงของ','5708เชียงแสน','5704เทิง','5706ป่าแดด','5712พญาเม็งราย','5705พาน','5701เมืองเชียงราย','5707แม่จัน','5715แม่ฟ้าหลวง','5716แม่ลาว','5710แม่สรวย','5709แม่สาย','5702เวียงชัย','5711เวียงป่าเป้า','5713เวียงแก่น');
arrBrn[58] = new Array('5802ขุนยวม','5807ปางมะผ้า','5803ปาย','5801เมืองแม่ฮ่องสอน','5805แม่ลาน้อย','5804แม่สะเรียง','5806สบเมย');
arrBrn[60] = new Array('6015กิ่งอำเภอชุมตาบง','6014กิ่งอำเภอแม่เปิน','6006เก้าเลี้ยว','6002โกรกพระ','6003ชุมแสง','6012ตากฟ้า','6007ตาคลี','6008ท่าตะโก','6005บรรพตพิสัย','6010พยุหะคีรี','6009ไพศาลี','6001เมืองนครสวรรค์','6013แม่วงก์','6011ลาดยาว','6004หนองบัว');
arrBrn[61] = new Array('6102ทัพทัน','6106บ้านไร่','6101เมืองอุทัยธานี','6107ลานสัก','6103สว่างอารมณ์','6105หนองขาหย่าง','6104หนองฉาง','6108ห้วยคต');
arrBrn[62] = new Array('6210กิ่งอำเภอบึงสามัคคี','6211กิ่งอำเภอโกสัมพีนคร','6204ขาณุวรลักษบุรี','6205คลองขลุง','6203คลองลาน','6208ทรายทองวัฒนา','6202ไทรงาม','6209ปางศิลาทอง','6206พรานกระต่าย','6201เมืองกำแพงเพชร','6207ลานกระบือ');
arrBrn[63] = new Array('6309กิ่งอำเภอวังเจ้า','6305ท่าสองยาง','6302บ้านตาก','6307พบพระ','6301เมืองตาก','6304แม่ระมาด','6306แม่สอด','6303สามเงา','6308อุ้มผาง');
arrBrn[64] = new Array('6404กงไกรลาศ','6403คีรีมาศ','6409ทุ่งเสลี่ยม','6402บ้านด่านลานหอย','6401เมืองสุโขทัย','6408ศรีนคร','6405ศรีสัชนาลัย','6406ศรีสำโรง','6407สวรรคโลก');
arrBrn[65] = new Array('6503ชาติตระการ','6502นครไทย','6509เนินมะปราง','6505บางกระทุ่ม','6504บางระกำ','6506พรหมพิราม','6501เมืองพิษณุโลก','6508วังทอง','6507วัดโบสถ์');
arrBrn[66] = new Array('6611กิ่งอำเภอดงเจริญ','6610กิ่งอำเภอบึงนาราง','6609กิ่งอำเภอสากเหล็ก','6604ตะพานหิน','6608ทับคล้อ','6605บางมูลนาก','6606โพทะเล','6603โพธิ์ประทับช้าง','6601เมืองพิจิตร','6612วชิรบารมี','6602วังทรายพูน','6607สามง่าม');
arrBrn[67] = new Array('6711เขาค้อ','6702ชนแดน','6709น้ำหนาว','6708บึงสามพัน','6701เมืองเพชรบูรณ์','6710วังโป่ง','6705วิเชียรบุรี','6706ศรีเทพ','6707หนองไผ่','6703หล่มสัก','6704หล่มเก่า');
arrBrn[70] = new Array('7010กิ่งอำเภอบ้านคา','7002จอมบึง','7004ดำเนินสะดวก','7006บางแพ','7005บ้านโป่ง','7008ปากท่อ','7007โพธาราม','7001เมืองราชบุรี','7009วัดเพลง','7003สวนผึ้ง');
arrBrn[71] = new Array('7111ด่านมะขามเตี้ย','7107ทองผาภูมิ','7102ไทรโยค','7105ท่ามะกา','7106ท่าม่วง','7103บ่อพลอย','7109พนมทวน','7101เมืองกาญจนบุรี','7110เลาขวัญ','7104ศรีสวัสดิ์','7108สังขละบุรี','7112หนองปรือ','7113ห้วยกระเจา');
arrBrn[72] = new Array('7206ดอนเจดีย์','7202เดิมบางนางบวช','7203ด่านช้าง','7204บางปลาม้า','7201เมืองสุพรรณบุรี','7205ศรีประจันต์','7207สองพี่น้อง','7208สามชุก','7210หนองหญ้าไซ','7209อู่ทอง');
arrBrn[73] = new Array('7302กำแพงแสน','7304ดอนตูม','7303นครชัยศรี','7305บางเลน','7307พุทธมณฑล','7301เมืองนครปฐม','7306สามพราน');
arrBrn[74] = new Array('7402กระทุ่มแบน','7403บ้านแพ้ว','7401เมืองสมุทรสาคร');
arrBrn[75] = new Array('7502บางคนที','7501เมืองสมุทรสงคราม','7503อัมพวา');
arrBrn[76] = new Array('7608แก่งกระจาน','7602เขาย้อย','7604ชะอำ','7605ท่ายาง','7606บ้านลาด','7607บ้านแหลม','7601เมืองเพชรบุรี','7603หนองหญ้าปล้อง');
arrBrn[77] = new Array('7708กิ่งอำเภอสามร้อยยอด','7702กุยบุรี','7703ทับสะแก','7704บางสะพาน','7705บางสะพานน้อย','7706ปราณบุรี','7701เมืองประจวบคีรีขันธ์','7707หัวหิน');
arrBrn[80] = new Array('8022กิ่งอำเภอช้างกลาง','8021กิ่งอำเภอนบพิตำ','8015ขนอม','8019จุฬาภรณ์','8004ฉวาง','8023เฉลิมพระเกียรติ','8007ชะอวด','8006เชียรใหญ่','8018ถ้ำพรรณรา','8009ทุ่งสง','8011ทุ่งใหญ่','8008ท่าศาลา','8010นาบอน','8017บางขัน','8012ปากพนัง','8002พรหมคีรี','8020พระพรหม','8005พิปูน','8001เมืองนครศรีธรรมราช','8013ร่อนพิบูลย์','8003ลานสกา','8014สิชล','8016หัวไทร');
arrBrn[81] = new Array('8103เกาะลันตา','8102เขาพนม','8104คลองท่อม','8106ปลายพระยา','8101เมืองกระบี่','8107ลำทับ','8108เหนือคลอง','8105อ่าวลึก');
arrBrn[82] = new Array('8203กะปง','8202เกาะยาว','8206คุระบุรี','8204ตะกั่วทุ่ง','8205ตะกั่วป่า','8207ทับปุด','8208ท้ายเหมือง','8201เมืองพังงา');
arrBrn[83] = new Array('8302กะทู้','8303ถลาง','8301เมืองภูเก็ต');
arrBrn[84] = new Array('8402กาญจนดิษฐ์','8419กิ่งอำเภอวิภาวดี','8405เกาะพะงัน','8404เกาะสมุย','8408คีรีรัฐนิคม','8414เคียนซา','8418ชัยบุรี','8406ไชยา','8403ดอนสัก','8411ท่าฉาง','8407ท่าชนะ','8409บ้านตาขุน','8412บ้านนาสาร','8413บ้านนาเดิม','8410พนม','8416พระแสง','8417พุนพิน','8401เมืองสุราษฎร์ธานี','8415เวียงสระ');
arrBrn[85] = new Array('8504กระบุรี','8503กะเปอร์','8505กิ่งอำเภอสุขสำราญ','8501เมืองระนอง','8502ละอุ่น');
arrBrn[86] = new Array('8608ทุ่งตะโก','8602ท่าแซะ','8603ปะทิว','8606พะโต๊ะ','8601เมืองชุมพร','8605ละแม','8607สวี','8604หลังสวน');
arrBrn[90] = new Array('9008กระแสสินธุ์','9016คลองหอยโข่ง','9013ควนเนียง','9003จะนะ','9005เทพา','9004นาทวี','9012นาหม่อม','9014บางกล่ำ','9001เมืองสงขลา','9007ระโนด','9009รัตภูมิ','9002สทิงพระ','9006สะบ้าย้อย','9010สะเดา','9015สิงหนคร','9011หาดใหญ่');
arrBrn[91] = new Array('9107กิ่งอำเภอมะนัง','9103ควนกาหลง','9102ควนโดน','9106ทุ่งหว้า','9104ท่าแพ','9101เมืองสตูล','9105ละงู');
arrBrn[92] = new Array('9202กันตัง','9210กิ่งอำเภอหาดสำราญ','9208นาโยง','9204ปะเหลียน','9201เมืองตรัง','9203ย่านตาขาว','9209รัษฎา','9207วังวิเศษ','9205สิเกา','9206ห้วยยอด');
arrBrn[93] = new Array('9302กงหรา','9311กิ่งอำเภอศรีนครินทร์','9303เขาชัยสน','9305ควนขนุน','9304ตะโหมด','9309บางแก้ว','9306ปากพะยูน','9308ป่าบอน','9310ป่าพะยอม','9301เมืองพัทลุง','9307ศรีบรรพต');
arrBrn[94] = new Array('9411กะพ้อ','9402โคกโพธิ์','9406ทุ่งยางแดง','9404ปะนาเระ','9405มายอ','9401เมืองปัตตานี','9412แม่ลาน','9408ไม้แก่น','9410ยะรัง','9409ยะหริ่ง','9407สายบุรี','9403หนองจิก');
arrBrn[95] = new Array('9507กาบัง','9508กิ่งอำเภอกรงปินัง','9504ธารโต','9503บันนังสตา','9502เบตง','9501เมืองยะลา','9505ยะหา','9506รามัน');
arrBrn[96] = new Array('9612จะแนะ','9613เจาะไอร้อง','9602ตากใบ','9603บาเจาะ','9601เมืองนราธิวาส','9604ยี่งอ','9605ระแงะ','9606รือเสาะ','9608แว้ง','9607ศรีสาคร','9609สุคิริน','9611สุไหงปาดี','9610สุไหงโก-ลก');
</script>

<script language="javascript">				
function listData(id){			
	if(id!=""){		
		var objData =eval("arrData["+id+"]");
		var strOpt = "";
		
		document.forms(0).lis_province.innerHTML ="";
		//document.forms(0).branch.innerHTML ="";
		if (id==0) {			
			addOption("------จังหวัด------",""); }
		else {	
			addOption("------จังหวัด------","");
			for(x=0;x<objData.length;x++){
				addOption(objData[x],objData[x].substring(0,2));
			}		
		}
		//var objData =eval("arrBrn["+id+"]");
		//addOptionBrn("------อำเภอ------","");
	}
}

function addOption(text,value){
	var oOption = document.createElement("OPTION");
	document.forms(0).lis_province.options.add(oOption);
	oOption.innerText =text.substring(2,text.length);
	oOption.value = value;
}	
	
/*-----------------------------------------------------------------------*/
function listBrn(id){
	if(id!=""){	
		var objBrn =eval("arrBrn["+id+"]");
		var strOpt = "";
	
		document.forms(0).branch.innerHTML ="";
		
			addOptionBrn("------อำเภอ------","");
			for(x=0;x<objBrn.length;x++){
				addOptionBrn(objBrn[x],objBrn[x].substring(0,4));
			}
	}
	else {
		document.forms(0).branch.innerHTML ="";
		addOptionBrn("------อำเภอ------","");		
	}
}
	
function addOptionBrn(text,value){
	var oOption = document.createElement("OPTION");
	document.forms(0).branch.options.add(oOption);
	oOption.innerText =text.substring(4,text.length);
	oOption.value = value;
}	

function listDiv(id){		
var id1;
	if(id!=""){	
		id1=id;
		id = 0;		
		var objDiv =eval("arrDiv["+id+"]");
		var strOpt = "";	
		document.forms(0).div.innerHTML ="";	
		for(x=0;x<objDiv.length;x++){		 
			addOptionDiv(objDiv[x],objDiv[x].substring(0,1));
		}	
		document.forms(0).div.value= id1;
	}
}
function addOptionDiv(text,value){
	var oOption = document.createElement("OPTION");
	document.forms(0).div.options.add(oOption);
	oOption.innerText =text.substring(1,text.length);
	oOption.value = value;
}	
</script>

<body background="images/bg.jpg" leftmargin="0" topmargin="0" marginwidth="0" marginheight="0">
<table width="100%" height="100%" border="0" cellpadding="0" cellspacing="0">
  <tr> 
    <td width="80%" height="30" valign="bottom" class="boxleft50">&nbsp;</td>
    <td width="20%" align="right" valign="middle" class="boxright15"><span class="txtmicrosoftsan8px"><span class="txtwhite"> 
      <? 
				//echo '$amc = '.$amc.'<br>';
				include ("images/lib/ms_database.php");
		  		if($username!="" && $password!="")
				{
					echo $login_user;
			?>
      <a class=link_red href="javascript: if(confirm('ต้องการที่จะออกจากระบบหรือไม่ !!')){ window.location='logout.php';}">ออกจากระบบ</a> 
      <?
				}	
			?>
      </span></span></td>
  </tr>
  <tr>
    <td height="120" colspan="2" align="center" valign="top"><form name="form1" method="get" action="rpt_asset_report.php" target="AssetMain" >
        <table width="98%" border="0" cellpadding="0" cellspacing="1" bgcolor="E5EEF9">
          <tr> 
            <td><table width="100%" border="0" cellpadding="0" cellspacing="2" bgcolor="#B5D5F1">
                <tr>
                  <td><table border="0" cellpadding="0" cellspacing="0" bgcolor="#E5EEF9" class="font1">
                      <tr> 
                        <td width="10" height="25" align="center" valign="middle"><input type="radio" name="radiobutton" value="radiobutton" checked> 
                        </td>
                        <td width="70">คณะกรรมการ</td>
                        <td width="40" align="right">ตำแหน่ง :&nbsp; </td>
                        <td width="125"><select name="list_committee" style="WIDTH: 120px">
                            <option value="0">เลือกตำแหน่ง</option>
                            <option value="01">ประธานกรรมการ</option>
                            <option value="02">รองประธานกรราการ</option>
                            <option value="03">เลขานุการ</option>
                            <option value="04">เหรัญญิก</option>
                            <option value="05">คณะกรรมการ</option>
                          </select></td>
                        <td width="1" bgcolor="#B5D5F1"> </td>
                        <td width="80" class="boxleft10">ฝ่ายกิจการสาขา : </td>
                        <td width="150" class="boxleft10"><select  style="WIDTH: 140px"  name="div" onChange="javascript:listData(this.value)">
                            <option value="">--รวมประเทศ--</option>
                            <option value="1">ฝ่ายกิจการสาขา 1</option>
                            <option value="2">ผ่ายกินจากสาขา 2</option>
                            <option value="3">ฝ่ายกิจการสาขา 3</option>
                            <option value="4">ผ่ายกิจการสาขา 4</option>
                            <option value="5">ฝ่ายกิจการสาขา 5</option>
                            <option value="6">ฝ่ายกิจการสาขา 6</option>
                            <option value="7">ฝ่ายกิจการสาขา 7</option>
                            <option value="8">ฝ่ายกิจการสาขา 8</option>
                            <option value="9">ฝ่ายกิจการสาขา 9</option>
                          </select></td>
                        <td width="200" class="boxleft10">&nbsp;</td>
                      </tr>
                      <tr> 
                        <td height="1" colspan="9" align="center" valign="middle" bgcolor="#B5D5F1"> 
                        </td>
                      </tr>
                      <tr> 
                        <td height="25" align="center" valign="middle"><input type="radio" name="radiobutton" value="radiobutton"> 
                        </td>
                        <td>พนักงาน</td>
                        <td align="right">ตำแหน่ง :&nbsp; </td>
                        <td><select name="list_personnel" style="WIDTH: 120px">
                            <option value="00">เลือกตำแหน่ง</option>
                            <option value="01">ผู้จัดการ</option>
                            <option value="02">รักษาการผู้จัดการ</option>
                            <option value="03">ผู้ช่วยผู้จัดการ</option>
                            <option value="04">รักษาการผู้ช่วยผู้ัจัดการ</option>
                            <option value="05">สมุห์บัญชี</option>
                            <option value="06">เจ้าหน้าที่บัญชี</option>
                            <option value="07">เจ้าหน้าที่การเงิน</option>
                            <option value="08">เจ้าหน้าที่การตลาด</option>
                            <option value="09">เจ้าหน้าที่ธุรการ</option>
                            <option value="10">นักการภารโรง</option>
                            <option value="11">พนักงานขับรถ</option>
                          </select></td>
                        <td bgcolor="#B5D5F1"> </td>
                        <td class="boxleft10">จังหวัด : <span class=normal-navyblue> 
                          </span></td>
                        <td class="boxleft10"><span class=normal-navyblue> 
                          <select style="WIDTH: 140px" name="lis_province">
                            <option value="">--สำนักงานจังหวัด--</option>
                          </select>
                          </span></td>
                        <td class="boxleft10">&nbsp;</td>
                      </tr>
                      <tr> 
                        <td height="1" colspan="9" align="center" valign="middle" bgcolor="#B5D5F1"> 
                        </td>
                      </tr>
                      <tr> 
                        <td height="25" align="center" valign="middle">&nbsp; </td>
                        <td>รหัสประชาชน : </td>
                        <td colspan="6" align="left" class="boxleft5"><input name="textfield" type="text" style="WIDTH: 100px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1"> &nbsp;&nbsp; ชื่อ : 
                          <input name="textfield2" type="text" style="WIDTH: 100px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1"> &nbsp;&nbsp; นามสกุล : 
                          <input name="textfield22" type="text" style="WIDTH: 100px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1">
                          &nbsp; หมายเลขโทรศัพท์ : 
                          <input name="textfield222" type="text" style="WIDTH: 80px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1"></td>
                      </tr>
                      <tr> 
                        <td height="1" colspan="9" align="center" valign="middle" bgcolor="#B5D5F1"> 
                        </td>
                      </tr>
					<tr> 
                        <td height="25" align="center" valign="middle">&nbsp; </td>
                        <td>วุฒิการศึกษา</td>
                        <td colspan="6" align="left" class="boxleft5"><select name="education" >
                            <option value="0">เลือกระดับการศึกษา</option>
							<option value="1">ไม่เกินประถมหรือเทียบเท่า</option>
                            <option value="2">ประถมศึกษา - มัธยมศึกษา</option>
                            <option value="3">มัธยมศึกษา - อนุปริญญา</option>
                            <option value="4">อนุปริญญา - ปริญญาตรี</option>
                            <option value="5">สูงกว่าปริญญาตรี</option>
                          </select> &nbsp;&nbsp; ที่อยู่ : 
                          <input name="textfield2" type="text" style="WIDTH: 180px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1">
                          &nbsp;&nbsp; </td>
                      </tr>  
					</table></td>
                </tr>
              </table> </td>
            <td width="70" align="center" bgcolor="#FBA404"><INPUT name="submit22" TYPE="submit" class="formButton" value="Submit"></td>
          </tr>
        </table>
        <br>
        <br>
        <table width="98%" border="0" cellpadding="0" cellspacing="1" bgcolor="E5EEF9">
          <tr> 
            <td><table width="100%" border="0" cellpadding="0" cellspacing="2" bgcolor="#B5D5F1">
                <tr> 
                  <td bgcolor="#E5EEF9"><table border="0" cellpadding="0" cellspacing="0" bgcolor="#E5EEF9" class="font1">
                      <tr> 
                        <td width="10" height="25" align="center" valign="middle"><input type="radio" name="radiobutton" value="radiobutton" checked> 
                        </td>
                        <td width="70">คณะกรรมการ</td>
                        <td width="40" align="right">ตำแหน่ง :&nbsp; </td>
                        <td width="125"><select name="list_committee" style="WIDTH: 120px">
                            <option value="0">เลือกตำแหน่ง</option>
                            <option value="01">ประธานกรรมการ</option>
                            <option value="02">รองประธานกรราการ</option>
                            <option value="03">เลขานุการ</option>
                            <option value="04">เหรัญญิก</option>
                            <option value="05">คณะกรรมการ</option>
                          </select></td>
                        <td width="1" bgcolor="#B5D5F1"> </td>
                        <td width="80" align="right" class="boxleft10">รหัสประชาชน 
                          :&nbsp;</td>
                        <td width="105"><input name="txt_user_id" type="text" style="WIDTH: 100px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1"></td>
                        <td width="1" bgcolor="#B5D5F1"> </td>
                        <td width="100" align="right">หมายเลขโทรศัพท์ :&nbsp;</td>
                        <td width="185" align="left"><input name="txt_phone" type="text" style="WIDTH: 100px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1"></td>
                        <td width="1" align="left" bgcolor="#B5D5F1"> </td>
                      </tr>
                      <tr> 
                        <td height="1" colspan="12" align="center" valign="middle" bgcolor="#B5D5F1"> 
                        </td>
                      </tr>
                      <tr> 
                        <td height="25" align="center" valign="middle"><input type="radio" name="radiobutton" value="radiobutton"> 
                        </td>
                        <td>พนักงาน</td>
                        <td align="right">ตำแหน่ง :&nbsp; </td>
                        <td><select name="list_personnel" style="WIDTH: 120px">
                            <option value="00">เลือกตำแหน่ง</option>
                            <option value="01">ผู้จัดการ</option>
                            <option value="02">รักษาการผู้จัดการ</option>
                            <option value="03">ผู้ช่วยผู้จัดการ</option>
                            <option value="04">รักษาการผู้ช่วยผู้ัจัดการ</option>
                            <option value="05">สมุห์บัญชี</option>
                            <option value="06">เจ้าหน้าที่บัญชี</option>
                            <option value="07">เจ้าหน้าที่การเงิน</option>
                            <option value="08">เจ้าหน้าที่การตลาด</option>
                            <option value="09">เจ้าหน้าที่ธุรการ</option>
                            <option value="10">นักการภารโรง</option>
                            <option value="11">พนักงานขับรถ</option>
                          </select></td>
                        <td bgcolor="#B5D5F1"> </td>
                        <td align="right" class="boxleft10">ชื่อ :&nbsp;</td>
                        <td> <input name="txt_name" type="text" style="WIDTH: 100px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1"> </td>
                        <td bgcolor="#B5D5F1"> </td>
                        <td align="right">ระดับการศึกษา :&nbsp;</td>
                        <td width="100" align="left"><select name="list_education" >
                            <option value="0">เลือกระดับการศึกษา</option>
                            <option value="1">ไม่เกินประถมหรือเทียบเท่า</option>
                            <option value="2">ประถมศึกษา - มัธยมศึกษา</option>
                            <option value="3">มัธยมศึกษา - อนุปริญญา</option>
                            <option value="4">อนุปริญญา - ปริญญาตรี</option>
                            <option value="5">สูงกว่าปริญญาตรี</option>
                          </select></td>
                        <td width="1" align="left" bgcolor="#B5D5F1"> </td>
                      </tr>
                      <tr> 
                        <td height="1" colspan="12" align="center" valign="middle" bgcolor="#B5D5F1"> 
                        </td>
                      </tr>
                      <tr> 
                        <td height="25" align="center" valign="middle">&nbsp;</td>
                        <td colspan="2" align="right">ฝ่ายกิจการสาขา :&nbsp;</td>
                        <td align="left"><select  style="WIDTH: 120px"  name="list_branch" onChange="javascript:listData(this.value)">
                            <option value="">--รวมประเทศ--</option>
                            <option value="1">ฝ่ายกิจการสาขา 1</option>
                            <option value="2">ผ่ายกินจากสาขา 2</option>
                            <option value="3">ฝ่ายกิจการสาขา 3</option>
                            <option value="4">ผ่ายกิจการสาขา 4</option>
                            <option value="5">ฝ่ายกิจการสาขา 5</option>
                            <option value="6">ฝ่ายกิจการสาขา 6</option>
                            <option value="7">ฝ่ายกิจการสาขา 7</option>
                            <option value="8">ฝ่ายกิจการสาขา 8</option>
                            <option value="9">ฝ่ายกิจการสาขา 9</option>
                          </select></td>
                        <td width="1" align="left" bgcolor="#B5D5F1" > </td>
                        <td align="right" class="boxleft5">นามสกุล :&nbsp;</td>
                        <td align="left"><input name="txt_lastname" type="text" style="WIDTH: 100px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1"></td>
                        <td align="left" bgcolor="#B5D5F1"> </td>
                        <td align="right">ที่อยู่ :&nbsp;</td>
                        <td align="left"><input name="txt_address" type="text" style="WIDTH: 180px; HEIGHT:17.5px; ></td>
                        <td bgcolor="#b5d5f1"></td>
                        <td align="left" bgcolor="#B5D5F1"> </td>
                      </tr>
                      <tr> 
                        <td height="1" colspan="12" align="center" valign="middle" bgcolor="#B5D5F1"> 
                        </td>
                      </tr>
                      <tr> 
                        <td height="25" align="center" valign="middle">&nbsp;</td>
                        <td colspan="2" align="right">จังหวัด :&nbsp;</td>
                        <td align="left"><span class=normal-navyblue> 
                          <select style="WIDTH: 120px" name="list_province">
                            <option value="">--สำนักงานจังหวัด--</option>
                          </select>
                          </span></td>
                        <td width="1" align="left" bgcolor="#B5D5F1" > </td>
                        <td colspan="6" align="right" class="boxleft5">&nbsp; </td>
                      </tr>
                    </table></td>
                </tr>
              </table></td>
            <td width="70" align="center" bgcolor="#FBA404"><INPUT name="submit222" TYPE="submit" class="formButton" value="Submit"></td>
          </tr>
        </table>
        <br>
      </form></td>
  </tr>
</table>
</body>
</html>
