<script language="JavaScript">
/*
สามารถ copy 8 บรรทัดนี้ไปไว้ใน FORM ใน file ASP ได้เลย
  <select name="div" style="WIDTH: 120px" onfocus="javascript:listDiv(this.value)" onChange="javascript:listData(this.value)">
    <option value="0">--รวมประเทศ--</option></select>  
  <select name="province" style="WIDTH: 200px" onChange="javascript:listBrn(this.value)">    
    <option value="0">--สำนักงานจังหวัด--</option></select>  
  <select name="branch" style="WIDTH: 100px" onChange="javascript:listAmp(this.value)">  
    <option value="0">--สาขา--</option></select>  
  <select name="ampher" style="WIDTH: 100px" onChange="javascript:listArea(this.value)">
    <option value="0">--อำเภอ--</option></select>
  <select name="area">
    <option value="0">--เขต--</option></select>
div =  รวมประเทศ/ภาค
branch = สาขา
province = จังหวัด
ampher = อำเภอ
area = เขต
*/
var arrDiv = new Array();
arrDiv[0] = new Array('0-รวมประเทศ-','1ภาคเหนือตอนบน','2ภาคเหนือตอนล่าง','3ภาคตะวันออกเฉียงเหนือตอนบน','4ภาคตะวันออกเฉียงเหนือตอนล่าง','5ภาคกลาง','6ภาคตะวันออก','7ภาคตะวันตก','8ภาคใต้ตอนบน','9ภาคใต้ตอนล่าง');
var arrData = new Array();
arrData[1] = new Array('01สนจ.เชียงราย','08สนจ.แพร่','23สนจ.เชียงใหม่','29สนจ.ลำปาง','47สนจ.ลำพูน','56สนจ.น่าน','72สนจ.พะเยา','82สนจ.แม่ฮ่องสอน');
arrData[2] = new Array('02สนจ.เพชรบูรณ์','09สนจ.สุโขทัย','18สนจ.นครสวรรค์','27สนจ.พิษณุโลก','28สนจ.พิจิตร','36สนจ.กำแพงเพชร','48สนจ.อุตรดิตถ์','49สนจ.อุทัยธานี','81สนจ.ตาก');
arrData[3] = new Array('05สนจ.อุดรธานี','06สนจ.ขอนแก่น','22สนจ.ร้อยเอ็ด','32สนจ.กาฬสินธุ์','33สนจ.เลย','37สนจ.สกลนคร','38สนจ.นครพนม','46สนจ.มหาสารคาม','52สนจ.หนองคาย','71สนจ.หนองบัวลำภู','73สนจ.มุกดาหาร');
arrData[4] = new Array('12สนจ.ชัยภูมิ','21สนจ.นครราชสีมา','26สนจ.สุรินทร์','39สนจ.ศรีสะเกษ','40สนจ.บุรีรัมย์','50สนจ.อุบลราชธานี','51สนจ.ยโสธร','77สนจ.อำนาจเจริญ');
arrData[5] = new Array('03สนจ.พระนครศรีอยุ','07สนจ.สระบุรี','16สนจ.ลพบุรี','17สนจ.ชัยนาท','20สนจ.นนทบุรี','30สนจ.อ่างทอง','58สนจ.กรุงเทพมหานค','67สนจ.ปทุมธานี','69สนจ.สิงห์บุรี');
arrData[6] = new Array('10สนจ.ปราจีนบุรี','13สนจ.ระยอง','25สนจ.ฉะเชิงเทรา','41สนจ.นครนายก','42สนจ.จันทบุรี','53สนจ.ชลบุรี','78สนจ.สระแก้ว','79สนจ.ตราด','80สนจ.สมุทรปราการ');
arrData[7] = new Array('04สนจ.เพชรบุรี','14สนจ.สุพรรณบุรี','24สนจ.นครปฐม','35สนจ.ประจวบคีรีขั','43สนจ.ราชบุรี','44สนจ.กาญจนบุรี','54สนจ.สมุทรสาคร');
arrData[8] = new Array('19สนจ.ชุมพร','31สนจ.สุราษฎร์ธานี','60สนจ.พังงา','76สนจ.กระบี่','83สนจ.ระนอง','84สนจ.ภูเก็ต');
arrData[9] = new Array('11สนจ.ปัตตานี','15สนจ.นครศรีธรรมรา','34สนจ.สงขลา','45สนจ.พัทลุง','55สนจ.นราธิวาส','57สนจ.ตรัง','61สนจ.ยะลา','75สนจ.สตูล');
var arrBrn = new Array();
arrBrn[01] = new Array('0100เชียงราย','0101พาน','0102แม่สรวย','0103แม่จัน','0104เชียงแสน','0105วาวี','0106แม่สาย','0107เวียงชัย','0108เวียงป่าเป้า','0109ป่าแดด','0111เทิง','0112เชียงของ','0113พญาเม็งราย','0114ขุนตาล','0115ปล้อง','0116เวียงแก่น');
arrBrn[02] = new Array('0200เพชรบูรณ์','0201หล่มสัก','0202ชนแดน','0203หล่มเก่า','0204วังโป่ง','0205ท่าพล','0206บึงสามพัน','0207สามแยกวิเชียรบุรี','0208หนองไผ่','0209ศรีเทพ','0211วิเชียรบุรี');
arrBrn[03] = new Array('0300พระนครศรีอยุธยา','0301วังน้อย','0302เสนา','0303ท่าเรือ','0304ลาดบัวหลวง','0305บางปะอิน','0306บางปะหัน','0307อุทัย','0314ผักไห่');
arrBrn[04] = new Array('0400เพชรบุรี','0401ชะอำ','0402ท่ายาง','0403บ้านลาด','0404เขาย้อย');
arrBrn[05] = new Array('0500อุดรธานี','0501น้ำโสม','0502กุมภวาปี','0503บ้านผือ','0504ศรีธาตุ','0505หนองหาน','0506บ้านดุง','0507หนองวัวซอ','0508โนนสะอาด','0509เพ็ญ','0511กุดจับ','0512ทุ่งฝน','0513วังสามหมอ');
arrBrn[06] = new Array('0600ขอนแก่น','0601บ้านไผ่','0602หนองสองห้อง','0603ชุมแพ','0604น้ำพอง','0605มัญจาคีรี','0606ตลาดกลางสินค้าเกษตรขอนแก่น','0607ภูเวียง','0608เมืองพล','0609หนองเรือ','0611กระนวน','0612ชนบท','0613สีชมพู','0614แวงน้อย','0615บ้านฝาง','0618เขาสวนกวาง');
arrBrn[07] = new Array('0700สระบุรี','0701พระพุทธบาท','0702มวกเหล็ก','0703แก่งคอย','0704หนองแค','0705บ้านหมอ','0706วิหารแดง','0707วังม่วง');
arrBrn[08] = new Array('0800แพร่','0801ร้องกวาง','0802ลอง','0803สอง','0804สูงเม่น','0805วังชิ้น','0806เด่นชัย');
arrBrn[09] = new Array('0900สุโขทัย','0901สวรรคโลก','0902กงไกรลาศ','0903ศรีสัชนาลัย','0904ศรีสำโรง','0905คีรีมาศ','0906ทุ่งเสลี่ยม','0907ศรีนคร');
arrBrn[10] = new Array('1000ปราจีนบุรี','1002กบินทร์บุรี','1004บ้านสร้าง','1006ศรีมหาโพธิ','1007ประจันตคาม');
arrBrn[11] = new Array('1100ปัตตานี','1106นาประดู่','1107ปาลัส','1108สายบุรี','1109โคกโพธิ์');
arrBrn[12] = new Array('1200ชัยภูมิ','1201จัตุรัส','1202ภูเขียว','1203บำเหน็จณรงค์','1204แก้งคร้อ','1205คอนสวรรค์','1206บ้านเขว้า','1207เกษตรสมบูรณ์','1208คอนสาร','1209หนองบัวแดง','1211หนองบัวระเหว');
arrBrn[13] = new Array('1300ระยอง','1301แกลง','1302ปลวกแดง','1303บ้านค่าย','1304วังจันทร์','1305เขาชะเมา');
arrBrn[14] = new Array('1400สุพรรณบุรี','1401สองพี่น้อง','1402อู่ทอง','1403บางปลาม้า','1404ดอนเจดีย์','1405สามชุก','1406ศรีประจันต์','1407ด่านช้าง','1408ตลาดกลางสินค้าเกษตรสุพรรณบุรี','1409เดิมบางนางบวช','1411หนองหญ้าไซ');
arrBrn[15] = new Array('1500นครศรีธรรมราช','1501ทุ่งสง','1502จันดี','1503สิชล','1504ท่าศาลา','1505ชะอวด','1506ทุ่งใหญ่','1507หัวไทร','1508พิปูน','1509ร่อนพิบูลย์','1511ลานสกา','1512ฉวาง','1513ขนอม','1514ปากพนัง','1519พรหมคีรี');
arrBrn[16] = new Array('1600ลพบุรี','1601พัฒนานิคม','1602โคกสำโรง','1603ลำนารายณ์','1604บ้านหมี่','1605หนองม่วง','1606สระโบสถ์','1607ท่าวุ้ง');
arrBrn[17] = new Array('1700ชัยนาท','1701หันคา','1702สรรคบุรี','1703วัดสิงห์','1704สรรพยา');
arrBrn[18] = new Array('1800นครสวรรค์','1801ท่าตะโก','1802ลาดยาว','1803ตาคลี','1804หนองบัว','1805บรรพตพิสัย','1806พยุหะคีรี','1807ไพศาลี','1808ตากฟ้า','1809ชุมแสง','1811แม่วงก์');
arrBrn[19] = new Array('1900ชุมพร','1901ท่าแซะ','1903สวี','1904หลังสวน','1905มาบอำมฤต','1907ละแม','1909ทุ่งตะโก');
arrBrn[20] = new Array('2000นนทบุรี','2001บางบัวทอง','2003ไทรน้อย','2004บางใหญ่');
arrBrn[21] = new Array('2100นครราชสีมา','2101สีคิ้ว','2102ด่านขุนทด','2103ครบุรี','2104จักราช','2105โนนไทย','2106ปากช่อง','2107โชคชัย','2108ปักธงชัย','2109สูงเนิน','2111เสิงสาง','2112ห้วยแถลง','2113ขามสะแกแสง','2114พิมาย','2115บัวใหญ่','2116ชุมพวง','2117ประทาย','2118โนนสูง','2119คง','2120แก้งสนามนาง','2121ขามทะเลสอ');
arrBrn[22] = new Array('2200ร้อยเอ็ด','2201สุวรรณภูมิ','2202โพนทอง','2203เกษตรวิสัย','2205จตุรพักตรพิมาน','2206เสลภูมิ','2207ธวัชบุรี','2208อาจสามารถ','2209พนมไพร','2211ปทุมรัตต์','2212โพธิ์ชัย');
arrBrn[23] = new Array('2300เชียงใหม่','2301จอมทอง','2302สันป่าตอง','2303สันกำแพง','2304แม่แตง','2305พร้าว','2307ฮอด','2308แม่โจ้','2309แม่วาง','2311ดอยสะเก็ด','2312หางดง','2313แม่ริม','2314ฝาง','2315ไชยปราการ','2316แม่อาย','2317ดอยหล่อ','2320เชียงดาว','2321แม่แจ่ม','2322สารภี');
arrBrn[24] = new Array('2400นครปฐม','2401บางเลน','2402กำแพงแสน','2403นครชัยศรี','2404สามพราน','2405ดอนตูม');
arrBrn[25] = new Array('2500ฉะเชิงเทรา','2501พนมสารคาม','2502บางน้ำเปรี้ยว','2503บางปะกง','2504บางคล้า','2505บ้านโพธิ์','2506สนามชัยเขต','2511แปลงยาว');
arrBrn[26] = new Array('2600สุรินทร์','2601สังขะ','2602ท่าตูม','2603ศีขรภูมิ','2604ปราสาท','2605ชุมพลบุรี','2606จอมพระ','2607รัตนบุรี');
arrBrn[27] = new Array('2700พิษณุโลก','2702ชาติตระการ','2703เนินมะปราง','2704บางกระทุ่ม','2705นครไทย','2706วัดโบสถ์','2707วังทอง','2708บางระกำ','2709พรหมพิราม');
arrBrn[28] = new Array('2800พิจิตร','2801สามง่าม','2802วังทรายพูน','2803โพธิ์ประทับช้าง','2804ตะพานหิน','2805บางมูลนาก','2806โพทะเล','2807ทับคล้อ','2808ดงเจริญ');
arrBrn[29] = new Array('2900ลำปาง','2901เสริมงาม','2902แจ้ห่ม','2903งาว','2904เถิน','2905แม่ทะ','2906ห้างฉัตร','2907เกาะคา','2908วังเหนือ','2909สบปราบ');
arrBrn[30] = new Array('3000อ่างทอง','3001โพธิ์ทอง','3002วิเศษชัยชาญ','3003แสวงหา');
arrBrn[31] = new Array('3100สุราษฎร์ธานี','3101คีรีรัฐนิคม','3102กาญจนดิษฐ์','3103ไชยา','3104บ้านตาขุน','3105ท่าชนะ','3106ดอนสัก','3107พุนพิน','3108บ้านนาสาร','3109บ้านนาเดิม','3111เวียงสระ','3112พระแสง','3113เกาะสมุย','3115ท่าฉาง');
arrBrn[32] = new Array('3200กาฬสินธุ์','3201กุฉินารายณ์','3202หนองกุงศรี','3203สมเด็จ','3204ยางตลาด','3205กมลาไสย','3206เขาวง','3207ห้วยเม็ก','3208คำม่วง','3209ท่าคันโท');
arrBrn[33] = new Array('3300เลย','3301วังสะพุง','3302ด่านซ้าย','3303เชียงคาน','3304หนองหิน','3305เอราวัณ','3306ภูเรือ');
arrBrn[34] = new Array('3400หาดใหญ่','3403คูหา','3404ลำไพล','3405ระโนด','3406สะเดา','3407นาทวี','3409สงขลา','3411สทิงพระ','3418คลองแงะ');
arrBrn[35] = new Array('3500ประจวบคีรีขันธ์','3501ปราณบุรี','3502กุยบุรี','3503บางสะพาน','3504หัวหิน','3505บางสะพานน้อย','3506ทับสะแก');
arrBrn[36] = new Array('3600กำแพงเพชร','3601สลกบาตร','3603คลองขลุง','3605ไทรงาม','3606พรานกระต่าย','3607คลองลาน','3608ปางศิลาทอง','3609บึงสามัคคี','3611ลานกระบือ');
arrBrn[37] = new Array('3700สกลนคร','3701พรรณานิคม','3703อากาศอำนวย','3704โคกศรีสุพรรณ','3705พังโคน','3706วานรนิวาส','3707สว่างแดนดิน','3708บ้านม่วง','3709กุสุมาลย์');
arrBrn[38] = new Array('3800นครพนม','3801บ้านแพง','3802ธาตุพนม','3803ศรีสงคราม','3804นาแก','3805ท่าอุเทน');
arrBrn[39] = new Array('3900ศรีสะเกษ','3901กันทรลักษ์','3902ขุขันธ์','3903ราษีไศล','3904อุทุมพรพิสัย','3905ขุนหาญ','3906กันทรารมย์','3907ปรางค์กู่','3908ศรีรัตนะ');
arrBrn[40] = new Array('4000บุรีรัมย์','4001นางรอง','4002พุทไธสง','4003ประโคนชัย','4004ลำปลายมาศ','4005ละหานทราย','4006สตึก','4007กระสัง','4008คูเมือง','4009บ้านกรวด','4011นาโพธิ์','4012หนองกี่');
arrBrn[41] = new Array('4100นครนายก','4101องครักษ์','4102บ้านนา','4103ปากพลี');
arrBrn[42] = new Array('4200จันทบุรี','4201ห้วยสะท้อน','4203ขลุง','4204สอยดาว','4206เขาคิชฌกูฏ','4207นายายอาม');
arrBrn[43] = new Array('4300ราชบุรี','4301จอมบึง','4302บ้านโป่ง','4303โพธาราม','4304ดำเนินสะดวก','4305สวนผึ้ง','4306บางแพ','4307ปากท่อ');
arrBrn[44] = new Array('4400กาญจนบุรี','4401ท่าเรือพระแท่น','4402พนมทวน','4403เลาขวัญ','4404บ่อพลอย','4405ไทรโยค');
arrBrn[45] = new Array('4500พัทลุง','4502ควนขนุน','4503แม่ขรี','4504ปากพะยูน','4505เขาชัยสน','4506ป่าพะยอม');
arrBrn[46] = new Array('4600มหาสารคาม','4601วาปีปทุม','4602พยัคฆภูมิพิสัย','4603โกสุมพิสัย','4604บรบือ','4605เชียงยืน','4606นาเชือก','4607กุดรัง','4608กันทรวิชัย');
arrBrn[47] = new Array('4700ลำพูน','4701ป่าซาง','4702ลี้','4703บ้านโฮ่ง','4704แม่ทา','4705บ้านธิ','4706เวียงหนองล่อง','4707อุโมงค์');
arrBrn[48] = new Array('4800อุตรดิตถ์','4805ฟากท่า','4806ลับแล','4807ตรอน','4808น้ำปาด','4809พิชัย');
arrBrn[49] = new Array('4900อุทัยธานี','4901ลานสัก','4902บ้านไร่','4903ทัพทัน','4904หนองฉาง','4905สว่างอารมณ์');
arrBrn[50] = new Array('5000อุบลราชธานี','5001เดชอุดม','5003ตระการพืชผล','5004พิบูลมังสาหาร','5005เขมราฐ','5006เขื่องใน','5007น้ำยืน','5008วารินชำราบ','5009บุณฑริก','5011สำโรง','5012ม่วงสามสิบ');
arrBrn[51] = new Array('5100ยโสธร','5101เลิงนกทา','5102มหาชนะชัย','5103กุดชุม','5104คำเขื่อนแก้ว','5105ป่าติ้ว');
arrBrn[52] = new Array('5200หนองคาย','5201บึงกาฬ','5202โพนพิสัย','5203ท่าบ่อ','5204เซกา','5205ปากคาด','5206สังคม','5207โซ่พิสัย');
arrBrn[53] = new Array('5300ชลบุรี','5301พนัสนิคม','5302แหลมฉบัง','5303บ้านบึง','5304บ่อทอง','5305พานทอง','5306พัทยา','5309แหลมฉบัง');
arrBrn[54] = new Array('5400สมุทรสาคร','5406อัมพวา','5407สมุทรสงคราม','5408บ้านแพ้ว');
arrBrn[55] = new Array('5500นราธิวาส','5501สุไหงปาดี','5502ตันหยงมัส','5503รือเสาะ');
arrBrn[56] = new Array('5600น่าน','5601เวียงสา','5602ปัว','5603นาน้อย','5604ท่าวังผา','5605เชียงกลาง','5606สันติสุข');
arrBrn[57] = new Array('5700ตรัง','5701ย่านตาขาว','5702กันตัง','5703ห้วยยอด','5704ทุ่งยาว','5705เขาวิเศษ','5706สิเกา','5707นาโยง');
arrBrn[58] = new Array('5800จตุจักร','5801ภาษีเจริญ','5802มีนบุรี','5804บางบอน','5805ลาดกระบัง','5814หนองจอก','5816หมอชิต 2');
arrBrn[60] = new Array('6000พังงา','6003ตะกั่วป่า','6004โคกกลอย','6005ภูเก็ต','6009ท้ายเหมือง','6011ทับปุด');
arrBrn[61] = new Array('6100ยะลา','6101เบตง','6102บันนังสตา','6103ยะหา');
arrBrn[67] = new Array('6700ตลาดไท','6701คลอง 9','6702ลำลูกกา','6703ปทุมธานี','6704ลาดหลุมแก้ว');
arrBrn[69] = new Array('6900สิงห์บุรี','6901อินทร์บุรี','6902บางระจัน');
arrBrn[71] = new Array('7100หนองบัวลำภู','7101นากลาง','7102ศรีบุญเรือง','7103สุวรรณคูหา');
arrBrn[72] = new Array('7200พะเยา','7201จุน','7202เชียงคำ','7203ดอกคำใต้','7204ปง','7205แม่ใจ','7206ภูซาง','7207เชียงม่วน');
arrBrn[73] = new Array('7300มุกดาหาร','7301นิคมคำสร้อย','7302คำชะอี','7303ดอนตาล');
arrBrn[75] = new Array('7500สตูล','7501ละงู','7502ควนกาหลง','7506ทุ่งหว้า');
arrBrn[76] = new Array('7600กระบี่','7601อ่าวลึก','7602คลองท่อม','7603เขาพนม');
arrBrn[77] = new Array('7700อำนาจเจริญ','7701หัวตะพาน','7702ลืออำนาจ','7703เสนางคนิคม','7704ชานุมาน');
arrBrn[78] = new Array('7800สระแก้ว','7801อรัญประเทศ','7802วังน้ำเย็น','7803วัฒนานคร','7804เขาฉกรรจ์');
arrBrn[79] = new Array('7900ตราด','7901แสนตุ้ง');
arrBrn[80] = new Array('8000สมุทรปราการ','8001บางบ่อ','8002บางพลี');
arrBrn[81] = new Array('8100ตาก','8101แม่สอด','8102พบพระ','8104สามเงา','8105อุ้มผาง');
arrBrn[82] = new Array('8200แม่ฮ่องสอน','8201แม่สะเรียง','8202ปาย');
arrBrn[83] = new Array('8300ระนอง','8301กระบุรี','8303กะเปอร์');
arrBrn[84] = new Array('8400ภูเก็ต','8401ถลาง');
</script>

<script language="javascript">				
function listData(id){			
	if(id!=""){		
		var objData =eval("arrData["+id+"]");
		var strOpt = "";
		
		document.forms(0).province.innerHTML ="";
		document.forms(0).branch.innerHTML ="";
		if (id==0) {			
			addOption("------สนจ.------",""); }
		else {	
			addOption("------สนจ.------","");
			for(x=0;x<objData.length;x++){
				addOption(objData[x],objData[x].substring(0,2));
			}		
		}
		var objData =eval("arrBrn["+id+"]");
		addOptionBrn("------สาขา------","");
	}
}

function addOption(text,value){
	var oOption = document.createElement("OPTION");
	document.forms(0).province.options.add(oOption);
	oOption.innerText =text.substring(2,text.length);
	oOption.value = value;
}	
	
/*-----------------------------------------------------------------------*/
function listBrn(id){
	if(id!=""){	
		var objBrn =eval("arrBrn["+id+"]");
		var strOpt = "";
	
		document.forms(0).branch.innerHTML ="";
		
			addOptionBrn("------สาขา------","");
			for(x=0;x<objBrn.length;x++){
				addOptionBrn(objBrn[x],objBrn[x].substring(0,4));
			}
	}
	else {
		document.forms(0).branch.innerHTML ="";
		addOptionBrn("------สาขา------","");		
	}
}
	
function addOptionBrn(text,value){
	var oOption = document.createElement("OPTION");
	document.forms(0).branch.options.add(oOption);
	oOption.innerText =text.substring(4,text.length);
	oOption.value = value;
}	

function listDiv(id){		
var id1;
	if(id!=""){	
		id1=id;
		id = 0;		
		var objDiv =eval("arrDiv["+id+"]");
		var strOpt = "";	
		document.forms(0).div.innerHTML ="";	
		for(x=0;x<objDiv.length;x++){		 
			addOptionDiv(objDiv[x],objDiv[x].substring(0,1));
		}	
		document.forms(0).div.value= id1;
	}
}
function addOptionDiv(text,value){
	var oOption = document.createElement("OPTION");
	document.forms(0).div.options.add(oOption);
	oOption.innerText =text.substring(1,text.length);
	oOption.value = value;
}	
</script>